Attribute VB_Name = "task_8"
Option Explicit

Sub Сoordinates()
Dim x1 As Integer, x2 As Integer, y1 As Integer, y2 As Integer
    
    x1 = InputBox("Введите координаты первой точки: x1 = ")
    y1 = InputBox("Введите координаты первой точки: y1 = ")
    
    If x1 > 0 And y1 > 0 Then
        MsgBox "Координаты первой точки: x1 = " & x1 & "  y1 = " & y1 & Chr(10) & "ПЕРВАЯ ТОЧКА находится в ПЕРВОЙ четверти"
    ElseIf x1 < 0 And y1 > 0 Then
        MsgBox "Координаты первой точки: x1 = " & x1 & "  y1 = " & y1 & Chr(10) & "ПЕРВАЯ ТОЧКА находится во ВТОРОЙ четверти"
    ElseIf x1 < 0 And y1 < 0 Then
        MsgBox "Координаты первой точки: x1 = " & x1 & "  y1 = " & y1 & Chr(10) & "ПЕРВАЯ ТОЧКА находится в ТРЕТЬЕЙ четверти"
    ElseIf x1 > 0 And y1 < 0 Then
        MsgBox "Координаты первой точки: x1 = " & x1 & "  y1 = " & y1 & Chr(10) & "ПЕРВАЯ ТОЧКА находится в ЧЕТВЕРТОЙ четверти"
    End If
    
    x2 = InputBox("Введите координаты второй точки: x2 = ")
    y2 = InputBox("Введите координаты второй точки: y2 = ")
    
    If x2 > 0 And y2 > 0 Then
        MsgBox "Координаты первой точки: x2 = " & x2 & "  y2 = " & y2 & Chr(10) & "ВТОРАЯ ТОЧКА находится в ПЕРВОЙ четверти"
    ElseIf x2 < 0 And y2 > 0 Then
        MsgBox "Координаты первой точки: x2 = " & x2 & "  y2 = " & y2 & Chr(10) & "ВТОРАЯ ТОЧКА находится во ВТОРОЙ четверти"
    ElseIf x2 < 0 And y2 < 0 Then
        MsgBox "Координаты первой точки: x2 = " & x2 & "  y2 = " & y2 & Chr(10) & "ВТОРАЯ ТОЧКА находится в ТРЕТЬЕЙ четверти"
    ElseIf x2 > 0 And y2 < 0 Then
        MsgBox "Координаты первой точки: x2 = " & x2 & "  y2 = " & y2 & Chr(10) & "ВТОРАЯ ТОЧКА находится в ЧЕТВЕРТОЙ четверти"
    End If
End Sub

